#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ChrisWilding/terraform-github/runs/run-TK3xLA622JCPMjnF

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.mazes_for_programmers: Refreshing state... [id=mazes-for-programmers]
github_repository.exercism_ocaml: Refreshing state... [id=exercism-ocaml]
github_repository.experiment_io_ts: Refreshing state... [id=experiment-io-ts]
github_repository.exercism_elixir: Refreshing state... [id=exercism-elixir]
github_repository.terraform_aws: Refreshing state... [id=terraform-aws]
github_repository.bill: Refreshing state... [id=bill]
github_repository.spring_microservices_in_action: Refreshing state... [id=spring-microservices-in-action]
github_repository.pact_broker_secrets: Refreshing state... [id=pact-broker-secrets]
github_repository.exercism_go: Refreshing state... [id=exercism-go]
github_repository.experiment_kafka: Refreshing state... [id=experiment-kafka]
github_repository.advent_of_code_2017: Refreshing state... [id=advent-of-code-2017]
github_repository.go_base: Refreshing state... [id=go-base]
github_repository.to_roman_numeral: Refreshing state... [id=to-roman-numeral]
github_repository.hotels: Refreshing state... [id=hotels]
github_repository.clox: Refreshing state... [id=clox]
github_repository.jlox: Refreshing state... [id=jlox]
github_repository.canvas: Refreshing state... [id=canvas]
github_repository.terraform_aws_secrets: Refreshing state... [id=terraform-aws-secrets]
github_repository.dotfiles: Refreshing state... [id=dotfiles]
github_repository.experiment_aurora_lambda: Refreshing state... [id=experiment-aurora-lambda]
github_repository.magidash: Refreshing state... [id=magidash]
github_repository.exercism_java: Refreshing state... [id=exercism-java]
github_repository.pact_broker: Refreshing state... [id=pact-broker]
github_repository.jinventory: Refreshing state... [id=jinventory]
github_repository.exercism_rust: Refreshing state... [id=exercism-rust]
github_repository.exercism_scala: Refreshing state... [id=exercism-scala]
github_repository.exercism_typescript: Refreshing state... [id=exercism-typescript]
github_repository.monkey: Refreshing state... [id=monkey]
github_repository.advent_of_code_2019: Refreshing state... [id=advent-of-code-2019]
github_repository.bookshelf_api: Refreshing state... [id=bookshelf-api]
github_repository.exercism_x86_64_assembly: Refreshing state... [id=exercism-x86-64-assembly]
github_repository.terraform_github: Refreshing state... [id=terraform-github]
github_repository.experiment_autotag: Refreshing state... [id=experiment-autotag]
github_repository.discography_api: Refreshing state... [id=discography-api]
github_repository.merchants_guide_to_the_galaxy: Refreshing state... [id=merchants-guide-to-the-galaxy]
github_repository.exercism_c: Refreshing state... [id=exercism-c]
github_repository.advent_of_code_2018: Refreshing state... [id=advent-of-code-2018]
github_repository.exercism_kotlin: Refreshing state... [id=exercism-kotlin]
github_repository.nasa: Refreshing state... [id=nasa]
github_repository.aws_nuke: Refreshing state... [id=aws-nuke]
github_repository.ginventory: Refreshing state... [id=ginventory]
github_repository.advent_of_code_2020: Refreshing state... [id=advent-of-code-2020]
github_repository.sahi: Refreshing state... [id=sahi]
github_repository.advent_of_code_2021: Refreshing state... [id=advent-of-code-2021]
github_repository.fsa: Refreshing state... [id=fsa]
github_repository.exercism_erlang: Refreshing state... [id=exercism-erlang]
github_repository.bump: Refreshing state... [id=bump]
github_repository.www_chriswilding_dev: Refreshing state... [id=www.chriswilding.dev]
github_repository.curriculum_vitae: Refreshing state... [id=curriculum-vitae]
github_branch_protection.mazes_for_programmers: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE2NjcxMzE=]
github_branch_protection.go_base: Refreshing state... [id=BPR_kwDOG6o6fs4BdUt4]
github_actions_secret.magidash_heroku_api_key: Refreshing state... [id=magidash:HEROKU_API_KEY]
github_branch_protection.jinventory: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjE3NDU0ODk=]
github_actions_secret.heroku_api_key: Refreshing state... [id=jinventory:HEROKU_API_KEY]
github_actions_secret.terraform_cloud_api_key: Refreshing state... [id=terraform-github:TERRAFORM_CLOUD_API_KEY]
github_branch_protection.terraform_github: Refreshing state... [id=BPR_kwDOFtzSP84BciXm]
github_actions_secret.aws_secret_access_key: Refreshing state... [id=aws-nuke:AWS_SECRET_ACCESS_KEY]
github_actions_secret.aws_access_key_id: Refreshing state... [id=aws-nuke:AWS_ACCESS_KEY_ID]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.go_base_terraform_cloud_api_key will be created
  + resource "github_actions_secret" "go_base_terraform_cloud_api_key" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "go-base"
      + secret_name     = "TERRAFORM_CLOUD_API_KEY"
      + updated_at      = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @ChrisWilding, Action: `pull_request`*